Tekla Open API Reference for Tekla Structures 2025
FilterExpressionFileType Enumeration
 The filter expression file type defines the filter expression file types.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum FilterExpressionFileType
Public Enumeration FilterExpressionFileType
Members
Member name | Value | Description
OBJECT_GROUP_SELECTION | 0 |  The object group selection filter.
OBJECT_GROUP_VIEW | 1 |  The object group view filter.
DRAWING_SINGLE_PART | 2 |  The drawing single part filter.
DRAWING_ASSEMBLY | 3 |  The drawing assembly filter.
DRAWING_CAST_UNIT | 4 |  The drawing cast unit filter.
DRAWING_GENERAL | 5 |  The drawing general filter.
See Also
Reference
Tekla.Structures.Filtering Namespace